src/Documents/СборДанных/СборДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СборДанных</name>
  <tabularSections>
    <name>РезультатСчитывания</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Гуид</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСканирования</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/СборДанных/Forms/ФормаДокумента/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ПоследнийШтрихкод;
&НаКлиенте
Перем ВремяПоследнегоСканирования;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	БлокировкаСканера = Ложь;
	ТекущийНомерСканирования = 0;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	БлокировкаСканера = Ложь;
	ТекстHTMLСканера = ПереформироватьПолеСканирования();
	ТекущийЭлемент = Элементы.СканерПоле;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТекстHTMLСканераПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
// Проверяем начало нашей спец-ссылки
	Если СтрНайти(ДанныеСобытия.Href, "v8://scanresult/") > 0 Тогда

		СтандартнаяОбработка = Ложь;
		ЧистыйШтрихкод = СтрЗаменить(ДанныеСобытия.Href, "v8://scanresult/", "");

		ТекущееВремя = ТекущаяДата();
		
		// Если штрихкод такой же и прошло меньше 2 секунд - игнорируем
		Если ЧистыйШтрихкод = ПоследнийШтрихкод И (ВремяПоследнегоСканирования <> Неопределено) И (ТекущееВремя
			- ВремяПоследнегоСканирования < 2) Тогда
			Возврат;
		КонецЕсли;

		ПоследнийШтрихкод = ЧистыйШтрихкод;
		ВремяПоследнегоСканирования = ТекущееВремя;
		
		
		// Ручное декодирование самых частых символов JSON, если они придут закодированными
		ЧистыйШтрихкод = СтрЗаменить(ЧистыйШтрихкод, "%7B", "{");
		ЧистыйШтрихкод = СтрЗаменить(ЧистыйШтрихкод, "%7D", "}");
		ЧистыйШтрихкод = СтрЗаменить(ЧистыйШтрихкод, "%22", """");
		ЧистыйШтрихкод = СтрЗаменить(ЧистыйШтрихкод, "%3A", ":");
		ЧистыйШтрихкод = СтрЗаменить(ЧистыйШтрихкод, "%2C", ",");

		Если Не ПустаяСтрока(ЧистыйШтрихкод) Тогда
			РазобратьДанныеJSON(ЧистыйШтрихкод);
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция РазобратьКодТерминала(Знач ИсходныйКод)

	ВходнаяСтрока = СокрЛП(ИсходныйКод);
	
	// 1. Поиск начала объекта
	ПозицияНачала = СтрНайти(ВходнаяСтрока, "{");
	ПозицияСледующей = 0;
	Если ПозицияНачала = 0 Тогда
		Возврат Новый Структура("Заголовок, ЧистыйJSON", "Ошибка", ВходнаяСтрока);
	КонецЕсли;
	ПозицияНачала = ?(ПозицияНачала = Неопределено, 0, ПозицияНачала);
	// 2. Обрезка дублей (ищем следующую открывающую скобку)
	Попытка
		ПозицияСледующей = СтрНайти(ВходнаяСтрока, "{", ПозицияНачала + 1);
	Исключение
		ПозицияСледующей = 0;
	КонецПопытки;

	Если ПозицияСледующей > 0 Тогда
		РабочаяЧасть = Сред(ВходнаяСтрока, ПозицияНачала, ПозицияСледующей - ПозицияНачала);
	Иначе
		РабочаяЧасть = Сред(ВходнаяСтрока, ПозицияНачала);
	КонецЕсли;

	РабочаяЧасть = СокрЛП(РабочаяЧасть);
	
	// 3. Исправление скобки (добавляем если нет)
	Если Прав(РабочаяЧасть, 1) <> "}" Тогда
		РабочаяЧасть = РабочаяЧасть + "}";
	КонецЕсли;

	ОтображаемоеЗаголовок = "Объект";
	ЧистыйJSONДляСохранения = РабочаяЧасть;
	
	// 4. Попытка распарсить JSON
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(РабочаяЧасть);

	Попытка
		ДанныеJSON = ПрочитатьJSON(ЧтениеJSON);
		
		// Записываем чистый JSON (нужен ЗаписьJSON)
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, ДанныеJSON);
		ЧистыйJSONДляСохранения = ЗаписьJSON.Закрыть();
		
		// Ищем ключ NAME (без учета регистра)
		Для Каждого КлючЗначение Из ДанныеJSON Цикл
			Если ВРег(КлючЗначение.Ключ) = "NAME" Тогда
				ОтображаемоеЗаголовок = Строка(КлючЗначение.Значение);
				Прервать;
			КонецЕсли;
		КонецЦикла;

		Если ОтображаемоеЗаголовок = "Объект" Тогда
			ОтображаемоеЗаголовок = "Без названия";
		КонецЕсли;

	Исключение
		// План Б: Поиск NAME в строке вручную
		ИмяИзСтроки = НайтиИмяВСтроке(РабочаяЧасть);
		Если ПустаяСтрока(ИмяИзСтроки) Тогда
			ОтображаемоеЗаголовок = "Ошибка разбора";
		Иначе
			ОтображаемоеЗаголовок = ИмяИзСтроки;
		КонецЕсли;
		
		// Сохраняем строку целиком, чтобы GUID не пропал
		ЧистыйJSONДляСохранения = СтрЗаменить(РабочаяЧасть, Символы.ПС, " ");
	КонецПопытки;

	ЧтениеJSON.Закрыть();

	Возврат Новый Структура("Заголовок, ЧистыйJSON", ОтображаемоеЗаголовок, ЧистыйJSONДляСохранения);

КонецФункции

&НаКлиенте
Функция НайтиИмяВСтроке(Знач СтрокаJSON)
	Кавычка = Символ(34);
	ШаблонИмени = Кавычка + "NAME" + Кавычка + ":";
	
	// Поиск "NAME": "значение" в строке
	ПозицияNAME = СтрНайти(ВРег(СтрокаJSON), ВРег(ШаблонИмени));

	Если ПозицияNAME > 0 Тогда
		// Ищем открывающую кавычку после NAME:"
		ДлинаПоиска = СтрДлина(ШаблонИмени);
		ЧастьПослеNAME = Сред(СтрокаJSON, ПозицияNAME + ДлинаПоиска);
		ПозицияКавычки1 = СтрНайти(ЧастьПослеNAME, Кавычка);
		Если ПозицияКавычки1 > 0 Тогда
			// Ищем закрывающую кавычку
			ЧастьВнутриКавычек = Сред(ЧастьПослеNAME, ПозицияКавычки1 + 1);
			ПозицияКавычки2 = СтрНайти(ЧастьВнутриКавычек, Кавычка);
			Если ПозицияКавычки2 > 0 Тогда
				Возврат Лев(ЧастьВнутриКавычек, ПозицияКавычки2 - 1);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Возврат "";
КонецФункции

&НаКлиенте
Процедура РазобратьДанныеJSON(Знач ТекстДанных)
	РезультатРазбора = РазобратьКодТерминала(ТекстДанных);

	Если РезультатРазбора.Заголовок = "Ошибка" Тогда
		Предупреждение("Ошибка чтения данных с терминала");
		Возврат;
	КонецЕсли;
	
	// Блокируем сканер перед обработкой
	БлокировкаСканера = Истина;
	
	// Парсим чистый JSON
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(РезультатРазбора.ЧистыйJSON);

	Попытка
		ДанныеJSON = ПрочитатьJSON(ЧтениеJSON);

		НайденнаяСтрока = НайтиСтрокуВТЧ(ДанныеJSON.GUID);
		ТекущийНомерСканирования = ТекущийНомерСканирования + 1;

		Если НайденнаяСтрока <> Неопределено Тогда
			НайденнаяСтрока.Количество = НайденнаяСтрока.Количество + 1;
			НайденнаяСтрока.НомерСканирования = ТекущийНомерСканирования;
		Иначе
			НоваяСтрока = Объект.РезультатСчитывания.Добавить();
			НоваяСтрока.Организация = СокрЛП(ДанныеJSON.ORG);
			НоваяСтрока.Наименование = СокрЛП(ДанныеJSON.NAME);
			НоваяСтрока.Гуид = СокрЛП(ДанныеJSON.GUID);
			НоваяСтрока.Количество = 1;
			НоваяСтрока.НомерСканирования = ТекущийНомерСканирования;
		КонецЕсли;

	Исключение
		Предупреждение("Ошибка чтения JSON: " + ОписаниеОшибки());
	КонецПопытки;

	ЧтениеJSON.Закрыть();
	
	// Подключаем обработчик ожидания для разблокировки через 1 сек
	ПодключитьОбработчикОжидания("РазблокироватьСканер", 1, Истина);
КонецПроцедуры

&НаКлиенте
Функция НайтиСтрокуВТЧ(Знач Гуид)
	Для Каждого СтрокаТЧ Из Объект.РезультатСчитывания Цикл
		Если СокрЛП(СтрокаТЧ.Гуид) = СокрЛП(Гуид) Тогда
			Возврат СтрокаТЧ;
		КонецЕсли;
	КонецЦикла;
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура РазблокироватьСканер()
	БлокировкаСканера = Ложь;
КонецПроцедуры

&НаКлиенте
Функция ПереформироватьПолеСканирования()

	HTMLКод =
	"<html>
	|<head>
	|   <meta name='viewport' content='width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no'>
	|   <style>
	|       html, body { margin: 0; padding: 0; height: 100%; overflow: hidden; background-color: transparent; }
	|       #container {
	|           width: 100%; 
	|           height: 100%; /* Контейнер займет всё место, выделенное в 1С */
	|           display: flex; 
	|           align-items: center; 
	|           justify-content: center;
	|           border-radius: 4px; 
	|           transition: background-color 0.3s; 
	|           cursor: pointer;
	|           box-sizing: border-box;
	|           border: 1px solid #ccc;
	|       }
	|       .blur-state { background-color: #ffc107; color: #000; }
	|       .focus-state { background-color: #4caf50; color: #fff; }
	|       
	|       #scanInput { 
	|           position: absolute; 
	|           top: 0; left: 0;
	|           width: 100%; height: 100%; 
	|           opacity: 0; /* Поле ввода невидимо, но ловит клики и фокус */
	|           cursor: pointer;
	|       }
	|       #statusText { 
	|           font-weight: bold; 
	|           font-size: 16px; /* Чуть крупнее для читаемости */
	|           text-align: center;
	|           pointer-events: none; 
	|           user-select: none;
	|       }
	|   </style>
	|</head>
	|<body>
	|   <div id='container' class='blur-state' onclick='document.getElementById(""scanInput"").focus();'>
	|       <span id='statusText'>⚠️ НАЖМИТЕ ДЛЯ АКТИВАЦИИ</span>
	|       <input id='scanInput' type='text' inputmode='none' autofocus>
	|   </div>
	|   <script>
	|       var input = document.getElementById('scanInput');
	|       var container = document.getElementById('container');
	|       var statusText = document.getElementById('statusText');
	|
	|       input.onfocus = function() {
	|           container.className = 'focus-state';
	|           statusText.innerText = '✅ СКАНЕР АКТИВЕН';
	|       };
	|
	|       input.onblur = function() {
	|           container.className = 'blur-state';
	|           statusText.innerText = '⚠️ НАЖМИТЕ ДЛЯ АКТИВАЦИИ';
	|       };
	|
	|       input.onchange = function() {
	|           if (input.value.length > 0) {
	|               window.location.href = 'v8://scanresult/' + encodeURIComponent(input.value);
	|               input.value = ''; 
	|           }
	|       };
	|
	|       // Повторный захват фокуса при клике в любое место body
	|       document.body.onclick = function() { input.focus(); };
	|   </script>
	|</body>
	|</html>";

	Возврат HTMLКод;

КонецФункции

#КонецОбласти
